arvi-kris-cy/pe84_ext_display/bsps/TARGET_APP_KIT_PSOCE84_EVK/config/GeneratedSource/cycfg_peripherals.h
/*******************************************************************************
* File Name: cycfg_peripherals.h
*
* Description:
* Peripheral Groups configuration
* This file was automatically generated and should not be modified.
* Configurator Backend 3.10.0
* device-db 4.5.0.5210
* mtb-pdl-cat1 3.5.4.31266
*
********************************************************************************
* Copyright 2024 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
********************************************************************************/

#if !defined(CYCFG_PERIPHERALS_H)
#define CYCFG_PERIPHERALS_H

#include "cycfg_notices.h"
#include "cy_graphics.h"
#include "cy_sysclk.h"
#if defined (CY_USING_HAL)
    #include "cyhal_hwmgr.h"
#endif //defined (CY_USING_HAL)

#if defined(__cplusplus)
extern "C" {
#endif

#define gfxss_0_ENABLED 1U
#define GFXSS_HW GFXSS
#define GFXSS_GPU_IRQ gfxss_interrupt_gpu_IRQn
#define GFXSS_DC_IRQ gfxss_interrupt_dc_IRQn
#define GFXSS_MIPIDSI_IRQ gfxss_interrupt_mipidsi_IRQn
#define peri_0_peri_group_2_ENABLED 1U
#define peri_1_peri_group_1_ENABLED 1U
#define peri_1_peri_group_3_ENABLED 1U

extern cy_stc_gfx_layer_config_t GFXSS_graphics_layer;
extern cy_stc_gfx_layer_config_t GFXSS_overlay0_layer;
extern cy_stc_gfx_layer_config_t GFXSS_overlay1_layer;
extern cy_stc_gfx_dc_config_t GFXSS_dc_config;
extern cy_stc_mipidsi_display_params_t GFXSS_mipidsi_display_params;
extern cy_stc_mipidsi_config_t GFXSS_mipi_dsi_config;
extern cy_stc_gfx_config_t GFXSS_config;

void init_cycfg_peripherals(void);

#if defined(__cplusplus)
}
#endif


#endif /* CYCFG_PERIPHERALS_H */
